'use client'

export default function Footer(){
    return(
        <footer className="w-full flex flex-col">
            <div className="bg-[#10071F] py-10 px-5 flex flex-col items-center">
                <h2 className="text-center font-bold text-[24px] pb-3 mt-5">Agende agora uma avaliação</h2>
                <p className="text-center font-normal mb-7">Sua transformação começa com um clique. Nossa equipe está pronta para te atender.</p>
                <a href="#" className="bg-[var(--terciary)] text-[#001E55] py-2 px-4 rounded-lg font-[var(--font-secondary)] font-semibold mb-5 text-center">Quero Avaliar Meu Sorriso</a>
            </div>

            <div className="bg-[var(--background-primary)] py-8 px-5">
                <span className="text-normal text-center text-[var(--text-primary)] w-full block mb-6">© 2025 Instituto do sorriso. Todos os direitos reservados.</span>
                <div className="flex items-center justify-center w-full gap-3">
                    <a href="https://www.facebook.com" aria-label="facebook do instituto do sorriso" target="_blank" className="link-svg-hover">
                        <svg width="33" height="33" viewBox="0 0 33 33" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M29.8327 16.6009C29.8327 9.24091 23.8593 3.26758 16.4993 3.26758C9.13935 3.26758 3.16602 9.24091 3.16602 16.6009C3.16602 23.0542 7.75268 28.4276 13.8327 29.6676V20.6009H11.166V16.6009H13.8327V13.2676C13.8327 10.6942 15.926 8.60091 18.4993 8.60091H21.8327V12.6009H19.166C18.4327 12.6009 17.8327 13.2009 17.8327 13.9342V16.6009H21.8327V20.6009H17.8327V29.8676C24.566 29.2009 29.8327 23.5209 29.8327 16.6009Z" fill="#F0F0F0"/>
                        </svg>
                    </a>
                    <a href="https://www.instagram.com" aria-label="instagram do instituto do sorriso" target="_blank" className="link-svg-hover">
                        <svg width="33" height="33" viewBox="0 0 33 33" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M10.8993 3.26758H22.0993C26.366 3.26758 29.8327 6.73424 29.8327 11.0009V22.2009C29.8327 24.2519 29.0179 26.2189 27.5676 27.6692C26.1174 29.1195 24.1504 29.9342 22.0993 29.9342H10.8993C6.63268 29.9342 3.16602 26.4676 3.16602 22.2009V11.0009C3.16602 8.9499 3.98078 6.9829 5.43106 5.53262C6.88134 4.08234 8.84834 3.26758 10.8993 3.26758ZM10.6327 5.93424C9.35964 5.93424 8.13874 6.43996 7.23857 7.34013C6.3384 8.24031 5.83268 9.46121 5.83268 10.7342V22.4676C5.83268 25.1209 7.97935 27.2676 10.6327 27.2676H22.366C23.6391 27.2676 24.86 26.7619 25.7601 25.8617C26.6603 24.9615 27.166 23.7406 27.166 22.4676V10.7342C27.166 8.08091 25.0193 5.93424 22.366 5.93424H10.6327ZM23.4993 7.93424C23.9414 7.93424 24.3653 8.10984 24.6779 8.4224C24.9904 8.73496 25.166 9.15888 25.166 9.60091C25.166 10.0429 24.9904 10.4669 24.6779 10.7794C24.3653 11.092 23.9414 11.2676 23.4993 11.2676C23.0573 11.2676 22.6334 11.092 22.3208 10.7794C22.0083 10.4669 21.8327 10.0429 21.8327 9.60091C21.8327 9.15888 22.0083 8.73496 22.3208 8.4224C22.6334 8.10984 23.0573 7.93424 23.4993 7.93424ZM16.4993 9.93424C18.2675 9.93424 19.9632 10.6366 21.2134 11.8869C22.4636 13.1371 23.166 14.8328 23.166 16.6009C23.166 18.369 22.4636 20.0647 21.2134 21.315C19.9632 22.5652 18.2675 23.2676 16.4993 23.2676C14.7312 23.2676 13.0355 22.5652 11.7853 21.315C10.5351 20.0647 9.83268 18.369 9.83268 16.6009C9.83268 14.8328 10.5351 13.1371 11.7853 11.8869C13.0355 10.6366 14.7312 9.93424 16.4993 9.93424ZM16.4993 12.6009C15.4385 12.6009 14.4211 13.0223 13.6709 13.7725C12.9208 14.5226 12.4993 15.54 12.4993 16.6009C12.4993 17.6618 12.9208 18.6792 13.6709 19.4293C14.4211 20.1795 15.4385 20.6009 16.4993 20.6009C17.5602 20.6009 18.5776 20.1795 19.3278 19.4293C20.0779 18.6792 20.4993 17.6618 20.4993 16.6009C20.4993 15.54 20.0779 14.5226 19.3278 13.7725C18.5776 13.0223 17.5602 12.6009 16.4993 12.6009Z" fill="#F0F0F0"/>
                        </svg>
                    </a>
                </div>
            </div>
        </footer>
    )
}